-- Наполнение таблицы "customer"
INSERT INTO customer (names, surname, address, email, phone)
VALUES
  ('Иван', 'Иванов', 'ул. Главная 1', 'ivan@gmail.com', '89254351256'),
  ('Анна', 'Петрова', 'ул. Вторая 2', 'anna@gmail.com', '89147865215'),
  ('Михаил', 'Сидоров', 'пр. Центральный 10', 'mikhail@gmail.com', '89094527862'),
  ('Елена', 'Васильева', 'ул. Парковая 5', 'elena@gmail.com', '89364524782'),
  ('Александр', 'Козлов', 'ул. Мира 15', 'alexander@gmail.com', '8941201454'),
  ('Ольга', 'Новикова', 'пр. Солнечный 20', 'olga@gmail.com', '89743254512'),
  ('Дмитрий', 'Попов', 'ул. Набережная 8', 'dmitry@gmail.com', '89621417485'),
  ('Наталья', 'Морозова', 'ул. Садовая 3', 'natalia@gmail.com', '89631451232'),
  ('Сергей', 'Ковалев', 'пр. Советский 12', 'sergei@gmail.com', '89746661244'),
  ('Мария', 'Федорова', 'ул. Лесная 7', 'maria@gmail.com', '89310120485');

-- Наполнение таблицы "orders"
INSERT INTO orders (order_date, order_status, payment_method, customer_id)
VALUES
  ('2023-07-01', 'CREATED', 'CREDIT_CARD', 1),
  ('2023-07-02', 'PROCESSING', 'PAY_PAL', 2),
  ('2023-07-03', 'SHIPPED', 'ON_RECEIPT', 3),
  ('2023-07-04', 'CREATED', 'PayPal', 4),
  ('2023-07-05', 'PROCESSING', 'CREDIT_CARD', 5),
  ('2023-07-06', 'SHIPPED', 'PAY_PAL', 6),
  ('2023-07-07', 'CANCELLED', 'ON_RECEIPT', 7),
  ('2023-07-08', 'CANCELLED', 'ON_RECEIPT', 8),
  ('2023-07-09', 'CREATED', 'CREDIT_CARD', 9),
  ('2023-07-10', 'SHIPPED', 'PAY_PAL', 10);

-- Наполнение таблицы "product"
INSERT INTO product (name, price, description, in_stock)
VALUES
  ('Молоко', 60, 'Молоко пастеризованное, 2.5% жирности', true),
  ('Хлеб', 35, 'Хлеб пшеничный цельнозерновой, 400 г', true),
  ('Макароны', 45, 'Макароны вермишель, 500 г', true),
  ('Картофель', 20, 'Картофель столовый, 1 кг', true),
  ('Морковь', 13, 'Морковь столовая, 1 кг', true),
  ('Яблоки', 70, 'Яблоки сорт "Антоновка", 1 кг', true),
  ('Сахар', 40, 'ахар-песок, 1 кг', true),
  ('Чай', 100, 'Чай черный байховый, 100 г', true),
  ('Сок', 90, 'Сок апельсиновый, 1 л', true),
  ('Кофе', 250, 'Кофе молотый, 250 г', true);


-- Наполнение таблицы "orderDetail"
INSERT INTO orderDetail (order_id, product_id, price, quantity)
VALUES
  (1, 1, 120, 2),
  (1, 2, 36, 1),
  (2, 3, 135, 3),
  (2, 4, 20, 1),
  (3, 5, 70, 2),
  (3, 6, 160, 1),
  (4, 7, 200, 4),
  (4, 8, 750, 2),
  (5, 9, 90, 1),
  (5, 10, 180, 3);
